{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-SKILL_HARD",
    "2": "I-SKILL_HARD",
    "3": "B-SKILL_SOFT",
    "4": "I-SKILL_SOFT",
    "5": "B-ENGLISH_LEVEL",
    "6": "I-ENGLISH_LEVEL",
    "7": "B-DEGREE",
    "8": "I-DEGREE",
    "9": "B-EXPERIENCE_LEVEL",
    "10": "I-EXPERIENCE_LEVEL",
    "11": "B-EXPERIENCE_YEARS",
    "12": "I-EXPERIENCE_YEARS",
    "13": "B-BENEFIT",
    "14": "I-BENEFIT",
    "15": "B-LOCATION",
    "16": "I-LOCATION",
    "17": "B-COMPANY_NAME",
    "18": "I-COMPANY_NAME",
    "19": "B-ROLE",
    "20": "I-ROLE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BENEFIT": 13,
    "B-COMPANY_NAME": 17,
    "B-DEGREE": 7,
    "B-ENGLISH_LEVEL": 5,
    "B-EXPERIENCE_LEVEL": 9,
    "B-EXPERIENCE_YEARS": 11,
    "B-LOCATION": 15,
    "B-ROLE": 19,
    "B-SKILL_HARD": 1,
    "B-SKILL_SOFT": 3,
    "I-BENEFIT": 14,
    "I-COMPANY_NAME": 18,
    "I-DEGREE": 8,
    "I-ENGLISH_LEVEL": 6,
    "I-EXPERIENCE_LEVEL": 10,
    "I-EXPERIENCE_YEARS": 12,
    "I-LOCATION": 16,
    "I-ROLE": 20,
    "I-SKILL_HARD": 2,
    "I-SKILL_SOFT": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
